app/Controllers/Home.php

    public function index()
    {
        $productModel = new ProductModel();
        $variantModel = new ProductVariantModel();
        $attributeModel = new AttributeModel();
        $attributeValueModel = new AttributeValueModel();

        $products = $productModel->findAll();

        $productVariants = $variantModel
            ->where('is_active', 1)
            ->findAll();

        $attributes = $attributeModel->findAll();
        $attributeValues = $attributeValueModel->findAll();
---
SELECT *
FROM `products`
SELECT *
FROM `product_variants`
WHERE `is_active` = 1
SELECT *
FROM `attributes`
SELECT *
FROM `attribute_values`

        if (!empty($productVariants)) {
            $variantIds = array_column($productVariants, 'id');

            $rows = $db->table('product_variant_attribute_values pva')
                ->select('pva.variant_id, attr.slug as attribute_slug, av.value')
                ->join('attribute_values av', 'pva.attribute_value_id = av.id')
                ->join('attributes attr', 'av.attribute_id = attr.id')
                ->whereIn('pva.variant_id', $variantIds)
                ->get()
                ->getResultArray();
---
SELECT `pva`.`variant_id`, `attr`.`slug` as `attribute_slug`, `av`.`value`
FROM `product_variant_attribute_values` `pva`
JOIN `attribute_values` `av` ON `pva`.`attribute_value_id` = `av`.`id`
JOIN `attributes` `attr` ON `av`.`attribute_id` = `attr`.`id`
WHERE `pva`.`variant_id` IN ('1','2','3','4')

    public function addToCart()
    {
        helper('url');

        $productId = $this->request->getPost('product_id');
        $variantId = $this->request->getPost('variant_id');
        $selectedSize = $this->request->getPost('size');
        $selectedColor = $this->request->getPost('color');
        $quantity = max(1, (int) $this->request->getPost('quantity'));

        $productModel = new ProductModel();
        $variantModel = new ProductVariantModel();
        $attributeValueModel = new AttributeValueModel();
        $cartModel = new CartItemModel();

        $product = $productModel->find($productId);
        if (!$product) {
            return redirect()->back()->with('error', 'Product not found');
        }

        $priceEach = (float) $product['base_price'];

        // If the user provides size/color, resolve the matching variant
        if (!$variantId && $selectedSize && $selectedColor) {
            $db = \Config\Database::connect();
            $sizeRow = $attributeValueModel->where('value', $selectedSize)->first();
            $colorRow = $attributeValueModel->where('value', $selectedColor)->first();

            if ($sizeRow && $colorRow) {
                $sizeVariantIds = $db->table('product_variant_attribute_values')
                    ->select('variant_id')
                    ->where('attribute_value_id', $sizeRow['id'])
                    ->get()
                    ->getResultArray();

                $colorVariantIds = $db->table('product_variant_attribute_values')
                    ->select('variant_id')
                    ->where('attribute_value_id', $colorRow['id'])
                    ->get()
                    ->getResultArray();
---
SELECT *
FROM `products`
WHERE `products`.`id` = '2'
SELECT *
FROM `attribute_values`
WHERE `value` = 'M'
 LIMIT 1
SELECT *
FROM `attribute_values`
WHERE `value` = 'Blue'
 LIMIT 1
SELECT `variant_id`
FROM `product_variant_attribute_values`
WHERE `attribute_value_id` = '2'
SELECT `variant_id`
FROM `product_variant_attribute_values`
WHERE `attribute_value_id` = '5'

    public function cart()
    {
        $sessionId = session()->get('cart_session_id');
        if (!$sessionId) {
            return redirect()->to('/')->with('error', 'No cart yet.');
        }

        $cartModel = new CartItemModel();

        $items = $cartModel
            ->where('session_id', $sessionId)
            ->findAll();

        $productModel = new ProductModel();
        $variantModel = new ProductVariantModel();

        $detailItems = [];
        $total = 0;

        foreach ($items as $item) {
            $product = $productModel->find($item['product_id']);
---
SELECT *
FROM `cart_items`
WHERE `session_id` = '4252f6c8fe2c73ecf6aad414fbe18a6e'
SELECT *
FROM `products`
WHERE `products`.`id` = '1'

    public function removeCartItem($id)
    {
        $cartModel = new CartItemModel();
        $cartModel->delete($id);
---
DELETE FROM `cart_items`
WHERE `id` IN ('2')